{
  "MissingAuthorizationHeader": "The request is missing the Authorization header. This header is required for authentication.",
  "TokenNotProvided": "The authentication token is not provided. Please include a valid token in the request.",
  "TokenVerificationFailed": "Failed to verify the authentication token. Please check the token validity and try again.",
  "InternalServerError": "An internal server error occurred while processing the request. Please try again later.",
  "NotAbleToRetrievingData": "An error occurred while retrieving {{data}}. Please check your request and try again later.",
  "UserNotFound": "User not found with the provided id/email {{uuid}}. Please verify the information and try again.",
  "UserAlreadyExist": "A user with the email address {{email}} already exists in the system. Please use a different email.",
  "UnableToCreateUser": "Unable to create a user with the email address {{email}}. Please check the provided information and try again.",
  "InvalidEmailOrPassword": "Invalid email or password. Please check your credentials and try again.",
  "InvalidEmail": "Invalid email address provided. Please provide a valid email address.",
  "InvalidPassword": "Invalid password provided. Passwords must be at least 8 characters long.",
  "InvalidName": "Invalid name provided. Please provide a valid name.",
  "LoginFailed": "Login failed. Please check your credentials and try again.",
  "Forbidden": "You do not have permission to access this resource.",
  "TokenRefreshFailed": "Failed to refresh token. Please log in again.",
  "CookieNotFound": "No cookie found in the request. Please ensure that cookies are enabled and try again.",
  "InvalidUuid": "Invalid UUID provided. Please provide a correctly formatted UUID and try again.",
  "NotAbleToSendEmailVerificationLink": "Failed to send the email verification link. Please try again later.",
  "TokenNotFound": "Verification token not found. Please request a new verification email.",
  "TokenExpired": "Verification token has expired. Please request a new verification email.",
  "UnableToVerifyToken": "Unable to verify the token. Please request a new verification email.",
  "UserUpdateFailed": "Failed to update user. Please try again later.",
  "InvalidBase64": "Image must be provided in base64 format.",
  "RedirectUrlRequired": "Must provide redirection url.",
  "UserDeleteFailed": "User deletion failed.",
  "EmailVerificationRequired": "Email verification is required to proceed."
}
